app/Controllers/Home.php

    public function index()
    {
        $get_data_kabupaten = $this->kabupatenModel->get_kab_prov();
        $get_data_provinsi = $this->provinceModel->findAll();
---
SELECT *
FROM `jmc_province`
SELECT *
FROM `province`

    public function search_by_province()
    {
        //search index
        $province = $this->request->getVar('provinsi');
        $kabupaten = $this->request->getVar('kabupaten');
        $get_data_by_search = $this->kabupatenModel->search_data($province, $kabupaten);
        $get_data_kabupaten = $this->kabupatenModel->get_kab_prov();
        $get_data_provinsi = $this->provinceModel->findAll();
---
SELECT *
FROM `jmc_province`