app/Models/KabupatenModel.php

SELECT *, `k`.`province_id` as `kpid`, `p`.`province_id` as `pid`
FROM `jmc_kabupaten` `k`
JOIN `jmc_province` `p` ON `k`.`province_id` = `p`.`province_id`
SELECT *, `k`.`province_id` as `kpid`, `p`.`province_id` as `pid`
FROM `kabupaten` `k`
JOIN `province` `p` ON `k`.`province_id` = `p`.`province_id`
---
    public function get_kab_prov()
    {
        $builder = $this->db->table($this->table . ' k');
        $builder->select('*, k.province_id as kpid, p.province_id as pid');
        $builder->join('province p', 'k.province_id = p.province_id');
        return $builder->get()->getResult();

SELECT *
FROM `jmc_kabupaten` `k`
JOIN `jmc_province` `p` ON `k`.`province_id` = `p`.`province_id`
WHERE `kabupaten_name` = 'kabupaten sorong'
---
    public function search_data($province, $kabupaten)
    {
        $builder = $this->db->table($this->table . ' k');
        $builder->select('*')
            ->join('province p', 'k.province_id = p.province_id');
        if ($province != NULL) {
            $builder->where('province_name', $province);
        } else if ($kabupaten != NULL) {
            $builder->where('kabupaten_name', $kabupaten);
        } else if ($province != NULL && $kabupaten != NULL) {
            $builder->where('kabupaten_name', $kabupaten);
            $builder->where('province_name', $province);
        }
        return $builder->get()->getResult();